src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Comment>полностью, кратко в наименовании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Comment>Код ручного доступа сотрудника к системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>является бригадиром</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для идентификации сотрудника как клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПланЗала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БригадыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Comment>является курьером доставки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пейджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветОповещенияГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставБригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОтчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Сотрудники/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		ПровСсылка = Ссылка;
		Если ЗначениеЗаполнено(КодДоступа) И НЕ ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "КодДоступа", КодДоступа) Тогда
			Сообщить("Код доступа уже использован у "+ПровСсылка.Наименование , СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Наименование) Тогда
			Сообщить("Не заполнено сокращенно!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ФИО) Тогда
			Сообщить("Не заполнено ФИО!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ПраваДоступа.Найти(Справочники.НаборыПравДоступа.ПустаяСсылка()) <> Неопределено Тогда
			ПраваДоступа.Очистить();
			Нов = ПраваДоступа.Добавить();
			Нов.МестоРеализации = Справочники.МестаРеализации.Мяснов;
			Нов.НаборПрав = Справочники.НаборыПравДоступа.НайтиПоНаименованию("Касса");
			Нов = ПраваДоступа.Добавить();
			Нов.МестоРеализации = Справочники.МестаРеализации.Отдохни;
			Нов.НаборПрав = Справочники.НаборыПравДоступа.НайтиПоНаименованию("Касса");
			Нов = ПраваДоступа.Добавить();
			Нов.МестоРеализации = Справочники.МестаРеализации.КМ;
			Нов.НаборПрав = Справочники.НаборыПравДоступа.НайтиПоНаименованию("Касса");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#Если Клиент Тогда
	
///////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ОТЧЕТОВ

// Возвращает доступные отчеты в зависимости от версии.
//
// Параметры:
//  Нет.
//
// Вовращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСписокОтчетов() Экспорт
	
	СписокОтчетов = Новый СписокЗначений;
	СписокОтчетов.Добавить("ОтчетПоРасходу",		"Отчет по расходу");
	Если глВерсия>1 Тогда
		СписокОтчетов.Добавить("ОтчетПоРасходуСпецифик","Отчет по расходу специфик");
	КонецЕсли;
	СписокОтчетов.Добавить("ОтчетПоВозвратам",		"Отчет по возвратам");
	СписокОтчетов.Добавить("ОтчетПоСебестоимости",	"Отчет по себестоимости блюд");
	СписокОтчетов.Добавить("ОтчетПоУдалениям",		"Отчет по удалениям");
	СписокОтчетов.Добавить("ОтчетПоВыручке",		"Отчет по выручке");
	СписокОтчетов.Добавить("ОтчетПоСкидкамНаценкам","Отчет по скидкам наценкам");
	Если глВерсия>1 Тогда
		СписокОтчетов.Добавить("СтопЛист","Анализ стоп-листа"); 
		СписокОтчетов.Добавить("АнализВремениОбслуживания","Анализ времени обслуживания");
	КонецЕсли;

	ЗаполнитьСписокОбработок(СписокОтчетов, Перечисления.ВидыОбработок.ВнешнийОтчет, "Справочник.Товары", Истина, Ложь);
	Возврат СписокОтчетов;
	
КонецФункции

// Строит отчет с предопределенными группировками.
//
Процедура СформироватьОтчет(ТипОтчета, ОбъектОтчета) Экспорт 
	
	Если ОбъектОтчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = Отчеты[ТипОтчета].Создать();
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Отчет.ДатаС = ДобавитьМесяц(ТекущаяДата(), -1);
	Отчет.ДатаПо  = КонецДня(ТекущаяДата());
	Отчет.Период = ПредставлениеПериода(Отчет.ДатаС,Отчет.ДатаПо);
	
	// установим группировки НашаНоменклатура и НашаХарактеристика
	ТаблицаГруппировокСтроки = ФормированиеОтчетов.ПолучитьПустуюТаблицуНастроекОтчета("Группировки");
	
	НоваяСтрока = ТаблицаГруппировокСтроки.Добавить();
	Если НЕ ТипОтчета = "СтопЛист" И НЕ ТипОтчета = "АнализВремениОбслуживания" Тогда
		НоваяСтрока.Поле           = "Официант";
	ИначеЕсли ТипОтчета = "АнализВремениОбслуживания" Тогда
		НоваяСтрока.Поле           = "АвторЗаказано";
	Иначе
		НоваяСтрока.Поле           = "Автор";
	КонецЕсли;
		
	НоваяСтрока.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	
	// заполним отборы
	ТаблицаОтборов = ФормированиеОтчетов.ПолучитьПустуюТаблицуНастроекОтчета("Отбор");
	
	НоваяСтрока = ТаблицаОтборов.Добавить();
	Если НЕ ТипОтчета = "СтопЛист" И НЕ ТипОтчета = "АнализВремениОбслуживания" Тогда
		НоваяСтрока.Поле           = "Официант";
	ИначеЕсли ТипОтчета = "АнализВремениОбслуживания" Тогда
		НоваяСтрока.Поле           = "АвторЗаказано";
	Иначе
		НоваяСтрока.Поле           = "Автор";
	КонецЕсли;
	Если ОбъектОтчета.ЭтоГруппа Тогда
		НоваяСтрока.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	Иначе
		НоваяСтрока.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	НоваяСтрока.Значение     = ОбъектОтчета.Ссылка;
	
	ФормированиеОтчетов.СформироватьОтчетПоПараметрам(Отчет, ТаблицаГруппировокСтроки, , ТаблицаОтборов);
	
КонецПроцедуры

#КонецЕсли
